# groups.py

groups = {
    '1': {      # Юриспруденция
        '1️⃣': 1080,
        '2️⃣': 1081,
        '3️⃣': None,
        '4️⃣': 1082
    },
    '2': {      # Экономика
        '1️⃣': None,
        '2️⃣': None,
        '3️⃣': 1096,
        '4️⃣': 1097
    },
    '3': {      # Менеджмент
        '1️⃣': None,
        '2️⃣': [1095, 1094],
        '3️⃣': 1093,
        '4️⃣': None
    },
    '4': {      # Прикладная информатика
        '1️⃣': 1075,
        '2️⃣': 1104,
        '3️⃣': 1105,
        '4️⃣': 1108
    },
    '6': {      # Реклама и связи с общественностью
        '1️⃣': 1074,
        '2️⃣': 1090,
        '3️⃣': 1091,
        '4️⃣': 1092
    },
    '7': {      # Сервис
        '1️⃣': 1072,
        '2️⃣': 1098,
        '3️⃣': 1099,
        '4️⃣': 1100
    },
    '8': {      # Хореографическое искусство
        '1️⃣': 1109,
        '2️⃣': 1110,
        '3️⃣': 1111,
        '4️⃣': 1112
    },
    '9': {      # Управление персоналом
        '1️⃣': None,
        '2️⃣': None,
        '3️⃣': 1070,
        '4️⃣': None
    },
    '10': {     # Журналистика
        '1️⃣': 1061,
        '2️⃣': 1062,
        '3️⃣': 1063,
        '4️⃣': 1064
    },
    '11': {     # Гостиничное дело
        '1️⃣': 1071,
        '2️⃣': 1106,
        '3️⃣': None,
        '4️⃣': 1107
    },
    '12': {     # Психология
        '1️⃣': 1073,
        '2️⃣': 1076,
        '3️⃣': 1077,
        '4️⃣': None
    },
    '13': {     # Туризм
        '1️⃣': None,
        '2️⃣': 1101,
        '3️⃣': 1102,
        '4️⃣': 1103
    },
    '14': {     # Юриспруденция(М)
        '1️⃣': 1083,
        '2️⃣': 1085,
    },
    '15': {     # Экономика(М)
        '1️⃣': 1116,
        '2️⃣': None,
    },
    '16': {     # Психология(М)
        '1️⃣': 1078,
        '2️⃣': None,
    },
}
